Revit 2026 API

# LightFamilyGetLightSourceTransform Method

---

Returns a Transform value for the transform of light source.

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform GetLightSourceTransform()
```
```vb
Public Function GetLightSourceTransform As Transform
```
```cpp
public:
Transform^ GetLightSourceTransform()
```
```fsharp
member GetLightSourceTransform : unit -> Transform
```

#### Return Value

Transform The light source transform.

When the user moves or rotates the light source in family editor, the returned Transform gets changed accordingly.

#### Reference

LightFamily Class

Autodesk.Revit.DB.Lighting Namespace